Revit 2024 API
MEPNetworkIterator Constructor
Overload List
Name | Description
MEPNetworkIterator(Document, MEPAnalyticalModelData, ConnectorDomainType)
 Creates an iterator by the analytical model data to visit all connected components in the network.
MEPNetworkIterator(Document, MEPAnalyticalNode, MEPAnalyticalSegment)
 Creates an iterator to visit the connected segments on one side of the network.
See Also
MEPNetworkIterator Class
MEPNetworkIterator Members
Autodesk.Revit.DB.Analysis Namespace